{
  "add_cross_attention": false,
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "embedding_size": 768,
  "eos_token_id": null,
  "finetuning_task": "ner",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-APPLICATION",
    "2": "B-ARTICLE",
    "3": "B-ATTACK",
    "4": "B-AUDIT",
    "5": "B-AUTHORIZATION",
    "6": "B-BANDWIDTH",
    "7": "B-CERTIFICATE",
    "8": "B-CLASSIFICATION",
    "9": "B-CLAUSE",
    "10": "B-COMPLIANCE",
    "11": "B-CONDITION",
    "12": "B-CYBER_ACTOR",
    "13": "B-DATA",
    "14": "B-DATABASE",
    "15": "B-DATA_TYPE",
    "16": "B-DEPLOYMENT",
    "17": "B-DEVELOPMENT",
    "18": "B-DIGITAL_PLATFORM",
    "19": "B-ENFORCEMENT",
    "20": "B-EXCEPTION",
    "21": "B-IMPACT",
    "22": "B-INCIDENT",
    "23": "B-INFRASTRUCTURE",
    "24": "B-INSPECTION",
    "25": "B-INTERCONNECTION",
    "26": "B-IT_ACTOR",
    "27": "B-IT_SERVICE",
    "28": "B-LAW",
    "29": "B-LEGAL_ACTION",
    "30": "B-LEGAL_ACTOR",
    "31": "B-LEGAL_CONCEPT",
    "32": "B-LEGAL_OBJECT",
    "33": "B-LEVEL",
    "34": "B-LICENSE",
    "35": "B-LOCATION",
    "36": "B-NETWORK",
    "37": "B-NETWORK_RESOURCE",
    "38": "B-OBLIGATION",
    "39": "B-OPERATION",
    "40": "B-PERMISSION",
    "41": "B-PLATFORM",
    "42": "B-PROHIBITION",
    "43": "B-QOS_STANDARD",
    "44": "B-RIGHT",
    "45": "B-RISK",
    "46": "B-SANCTION",
    "47": "B-SCOPE",
    "48": "B-SECURITY_MEASURE",
    "49": "B-SECURITY_POLICY",
    "50": "B-SERVICE",
    "51": "B-SOFTWARE",
    "52": "B-STANDARD",
    "53": "B-STATUS",
    "54": "B-STRUCTURAL",
    "55": "B-SUBSCRIBER",
    "56": "B-SYSTEM",
    "57": "B-TARIFF",
    "58": "B-TECHNICAL_REGULATION",
    "59": "B-TELECOM_OPERATOR",
    "60": "B-THREAT",
    "61": "B-TIME",
    "62": "B-VIOLATION",
    "63": "B-VULNERABILITY",
    "64": "I-APPLICATION",
    "65": "I-ATTACK",
    "66": "I-AUDIT",
    "67": "I-AUTHORIZATION",
    "68": "I-BANDWIDTH",
    "69": "I-CERTIFICATE",
    "70": "I-CLASSIFICATION",
    "71": "I-CLAUSE",
    "72": "I-COMPLIANCE",
    "73": "I-CONDITION",
    "74": "I-CYBER_ACTOR",
    "75": "I-DATA",
    "76": "I-DATABASE",
    "77": "I-DATA_TYPE",
    "78": "I-DEPLOYMENT",
    "79": "I-DEVELOPMENT",
    "80": "I-DIGITAL_PLATFORM",
    "81": "I-ENFORCEMENT",
    "82": "I-EXCEPTION",
    "83": "I-IMPACT",
    "84": "I-INCIDENT",
    "85": "I-INFRASTRUCTURE",
    "86": "I-INSPECTION",
    "87": "I-INTERCONNECTION",
    "88": "I-IT_ACTOR",
    "89": "I-IT_SERVICE",
    "90": "I-LAW",
    "91": "I-LEGAL_ACTION",
    "92": "I-LEGAL_ACTOR",
    "93": "I-LEGAL_CONCEPT",
    "94": "I-LEGAL_OBJECT",
    "95": "I-LEVEL",
    "96": "I-LICENSE",
    "97": "I-NETWORK",
    "98": "I-NETWORK_RESOURCE",
    "99": "I-OBLIGATION",
    "100": "I-OPERATION",
    "101": "I-PERMISSION",
    "102": "I-PLATFORM",
    "103": "I-PROHIBITION",
    "104": "I-QOS_STANDARD",
    "105": "I-RIGHT",
    "106": "I-RISK",
    "107": "I-SANCTION",
    "108": "I-SCOPE",
    "109": "I-SECURITY_MEASURE",
    "110": "I-SECURITY_POLICY",
    "111": "I-SERVICE",
    "112": "I-SOFTWARE",
    "113": "I-STANDARD",
    "114": "I-STATUS",
    "115": "I-STRUCTURAL",
    "116": "I-SUBSCRIBER",
    "117": "I-SYSTEM",
    "118": "I-TARIFF",
    "119": "I-TECHNICAL_REGULATION",
    "120": "I-TELECOM_OPERATOR",
    "121": "I-THREAT",
    "122": "I-TIME",
    "123": "I-VIOLATION",
    "124": "I-VULNERABILITY"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-APPLICATION": 1,
    "B-ARTICLE": 2,
    "B-ATTACK": 3,
    "B-AUDIT": 4,
    "B-AUTHORIZATION": 5,
    "B-BANDWIDTH": 6,
    "B-CERTIFICATE": 7,
    "B-CLASSIFICATION": 8,
    "B-CLAUSE": 9,
    "B-COMPLIANCE": 10,
    "B-CONDITION": 11,
    "B-CYBER_ACTOR": 12,
    "B-DATA": 13,
    "B-DATABASE": 14,
    "B-DATA_TYPE": 15,
    "B-DEPLOYMENT": 16,
    "B-DEVELOPMENT": 17,
    "B-DIGITAL_PLATFORM": 18,
    "B-ENFORCEMENT": 19,
    "B-EXCEPTION": 20,
    "B-IMPACT": 21,
    "B-INCIDENT": 22,
    "B-INFRASTRUCTURE": 23,
    "B-INSPECTION": 24,
    "B-INTERCONNECTION": 25,
    "B-IT_ACTOR": 26,
    "B-IT_SERVICE": 27,
    "B-LAW": 28,
    "B-LEGAL_ACTION": 29,
    "B-LEGAL_ACTOR": 30,
    "B-LEGAL_CONCEPT": 31,
    "B-LEGAL_OBJECT": 32,
    "B-LEVEL": 33,
    "B-LICENSE": 34,
    "B-LOCATION": 35,
    "B-NETWORK": 36,
    "B-NETWORK_RESOURCE": 37,
    "B-OBLIGATION": 38,
    "B-OPERATION": 39,
    "B-PERMISSION": 40,
    "B-PLATFORM": 41,
    "B-PROHIBITION": 42,
    "B-QOS_STANDARD": 43,
    "B-RIGHT": 44,
    "B-RISK": 45,
    "B-SANCTION": 46,
    "B-SCOPE": 47,
    "B-SECURITY_MEASURE": 48,
    "B-SECURITY_POLICY": 49,
    "B-SERVICE": 50,
    "B-SOFTWARE": 51,
    "B-STANDARD": 52,
    "B-STATUS": 53,
    "B-STRUCTURAL": 54,
    "B-SUBSCRIBER": 55,
    "B-SYSTEM": 56,
    "B-TARIFF": 57,
    "B-TECHNICAL_REGULATION": 58,
    "B-TELECOM_OPERATOR": 59,
    "B-THREAT": 60,
    "B-TIME": 61,
    "B-VIOLATION": 62,
    "B-VULNERABILITY": 63,
    "I-APPLICATION": 64,
    "I-ATTACK": 65,
    "I-AUDIT": 66,
    "I-AUTHORIZATION": 67,
    "I-BANDWIDTH": 68,
    "I-CERTIFICATE": 69,
    "I-CLASSIFICATION": 70,
    "I-CLAUSE": 71,
    "I-COMPLIANCE": 72,
    "I-CONDITION": 73,
    "I-CYBER_ACTOR": 74,
    "I-DATA": 75,
    "I-DATABASE": 76,
    "I-DATA_TYPE": 77,
    "I-DEPLOYMENT": 78,
    "I-DEVELOPMENT": 79,
    "I-DIGITAL_PLATFORM": 80,
    "I-ENFORCEMENT": 81,
    "I-EXCEPTION": 82,
    "I-IMPACT": 83,
    "I-INCIDENT": 84,
    "I-INFRASTRUCTURE": 85,
    "I-INSPECTION": 86,
    "I-INTERCONNECTION": 87,
    "I-IT_ACTOR": 88,
    "I-IT_SERVICE": 89,
    "I-LAW": 90,
    "I-LEGAL_ACTION": 91,
    "I-LEGAL_ACTOR": 92,
    "I-LEGAL_CONCEPT": 93,
    "I-LEGAL_OBJECT": 94,
    "I-LEVEL": 95,
    "I-LICENSE": 96,
    "I-NETWORK": 97,
    "I-NETWORK_RESOURCE": 98,
    "I-OBLIGATION": 99,
    "I-OPERATION": 100,
    "I-PERMISSION": 101,
    "I-PLATFORM": 102,
    "I-PROHIBITION": 103,
    "I-QOS_STANDARD": 104,
    "I-RIGHT": 105,
    "I-RISK": 106,
    "I-SANCTION": 107,
    "I-SCOPE": 108,
    "I-SECURITY_MEASURE": 109,
    "I-SECURITY_POLICY": 110,
    "I-SERVICE": 111,
    "I-SOFTWARE": 112,
    "I-STANDARD": 113,
    "I-STATUS": 114,
    "I-STRUCTURAL": 115,
    "I-SUBSCRIBER": 116,
    "I-SYSTEM": 117,
    "I-TARIFF": 118,
    "I-TECHNICAL_REGULATION": 119,
    "I-TELECOM_OPERATOR": 120,
    "I-THREAT": 121,
    "I-TIME": 122,
    "I-VIOLATION": 123,
    "I-VULNERABILITY": 124,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 62000
}
